### DataFrame

In [1]:
from pyspark import SparkConf , SparkContext
from pyspark.sql import SQLContext

In [2]:
conf = SparkConf().setMaster('local').setAppName('sparkApp')
spark = SparkContext(conf=conf)
spark

In [3]:
sqlCtx = SQLContext(spark)
sqlCtx

- csv 파일을 이용한 dataframe 만들기

In [6]:
orders = sqlCtx.read.csv('C:/Users/i/TIL/Spark/exec_data/orders.csv' , header=True , inferSchema=True)
orders.printSchema()

root
 |-- OrderID: integer (nullable = true)
 |-- CustomerID: integer (nullable = true)
 |-- EmployeeID: integer (nullable = true)
 |-- OrderDate: string (nullable = true)
 |-- ShipperID: double (nullable = true)

In [13]:
orders.describe().show()

+-------+-----------------+------------------+------------------+---------+------------------+
|summary|          OrderID|        CustomerID|        EmployeeID|OrderDate|         ShipperID|
+-------+-----------------+------------------+------------------+---------+------------------+
|  count|              196|               196|               196|      196|               196|
|   mean|          10345.5| 48.64795918367347|4.3520408163265305|     null|2.0714285714285716|
| stddev|56.72448031200168|25.621776513566466|  2.41651283366105|     null|0.7877263614433762|
|    min|            10248|                 2|                 1| 1/1/1997|               1.0|
|    max|            10443|                91|                 9| 9/9/1996|               3.0|
+-------+-----------------+------------------+------------------+---------+------------------+

In [17]:
orders.show()

+-------+----------+----------+---------+---------+
|OrderID|CustomerID|EmployeeID|OrderDate|ShipperID|
+-------+----------+----------+---------+---------+
|  10248|        90|         5| 7/4/1996|      3.0|
|  10249|        81|         6| 7/5/1996|      1.0|
|  10250|        34|         4| 7/8/1996|      2.0|
|  10251|        84|         3| 7/8/1996|      1.0|
|  10252|        76|         4| 7/9/1996|      2.0|
|  10253|        34|         3|7/10/1996|      2.0|
|  10254|        14|         5|7/11/1996|      2.0|
|  10255|        68|         9|7/12/1996|      3.0|
|  10256|        88|         3|7/15/1996|      2.0|
|  10257|        35|         4|7/16/1996|      3.0|
|  10258|        20|         1|7/17/1996|      1.0|
|  10259|        13|         4|7/18/1996|      3.0|
|  10260|        55|         4|7/19/1996|      1.0|
|  10261|        61|         4|7/19/1996|      2.0|
|  10262|        65|         8|7/22/1996|      3.0|
|  10263|        20|         9|7/23/1996|      3.0|
|  10264|        24|         6|7/24/1996|      3.0|
|  10265|         7|         2|7/25/1996|      1.0|
|  10266|        87|         3|7/26/1996|      3.0|
|  10267|        25|         4|7/29/1996|      1.0|
+-------+----------+----------+---------+---------+
only showing top 20 rows

In [18]:
orders.summary().show()

+-------+-----------------+------------------+------------------+---------+------------------+
|summary|          OrderID|        CustomerID|        EmployeeID|OrderDate|         ShipperID|
+-------+-----------------+------------------+------------------+---------+------------------+
|  count|              196|               196|               196|      196|               196|
|   mean|          10345.5| 48.64795918367347|4.3520408163265305|     null|2.0714285714285716|
| stddev|56.72448031200168|25.621776513566466|  2.41651283366105|     null|0.7877263614433762|
|    min|            10248|                 2|                 1| 1/1/1997|               1.0|
|    25%|            10296|                25|                 2|     null|               1.0|
|    50%|            10345|                51|                 4|     null|               2.0|
|    75%|            10394|                69|                 6|     null|               3.0|
|    max|            10443|                91|                 9| 9/9/1996|               3.0|
+-------+-----------------+------------------+------------------+---------+------------------+

In [19]:
orders.first()

Row(OrderID=10248, CustomerID=90, EmployeeID=5, OrderDate='7/4/1996', ShipperID=3.0)

In [20]:
# 검색 select()
orders.select(['OrderID' , 'CustomerID']).show()

+-------+----------+
|OrderID|CustomerID|
+-------+----------+
|  10248|        90|
|  10249|        81|
|  10250|        34|
|  10251|        84|
|  10252|        76|
|  10253|        34|
|  10254|        14|
|  10255|        68|
|  10256|        88|
|  10257|        35|
|  10258|        20|
|  10259|        13|
|  10260|        55|
|  10261|        61|
|  10262|        65|
|  10263|        20|
|  10264|        24|
|  10265|         7|
|  10266|        87|
|  10267|        25|
+-------+----------+
only showing top 20 rows

In [21]:
# withColumn
# orders.show()
orders.withColumn('newOrderID' , orders['OrderID']+2).show()

+-------+----------+----------+---------+---------+----------+
|OrderID|CustomerID|EmployeeID|OrderDate|ShipperID|newOrderID|
+-------+----------+----------+---------+---------+----------+
|  10248|        90|         5| 7/4/1996|      3.0|     10250|
|  10249|        81|         6| 7/5/1996|      1.0|     10251|
|  10250|        34|         4| 7/8/1996|      2.0|     10252|
|  10251|        84|         3| 7/8/1996|      1.0|     10253|
|  10252|        76|         4| 7/9/1996|      2.0|     10254|
|  10253|        34|         3|7/10/1996|      2.0|     10255|
|  10254|        14|         5|7/11/1996|      2.0|     10256|
|  10255|        68|         9|7/12/1996|      3.0|     10257|
|  10256|        88|         3|7/15/1996|      2.0|     10258|
|  10257|        35|         4|7/16/1996|      3.0|     10259|
|  10258|        20|         1|7/17/1996|      1.0|     10260|
|  10259|        13|         4|7/18/1996|      3.0|     10261|
|  10260|        55|         4|7/19/1996|      1.0|     10262|
|  10261|        61|         4|7/19/1996|      2.0|     10263|
|  10262|        65|         8|7/22/1996|      3.0|     10264|
|  10263|        20|         9|7/23/1996|      3.0|     10265|
|  10264|        24|         6|7/24/1996|      3.0|     10266|
|  10265|         7|         2|7/25/1996|      1.0|     10267|
|  10266|        87|         3|7/26/1996|      3.0|     10268|
|  10267|        25|         4|7/29/1996|      1.0|     10269|
+-------+----------+----------+---------+---------+----------+
only showing top 20 rows

In [22]:
# 컬럼 이름 변경
orders.withColumnRenamed('OrderID' , 'renameOrderID').show()

+-------------+----------+----------+---------+---------+
|renameOrderID|CustomerID|EmployeeID|OrderDate|ShipperID|
+-------------+----------+----------+---------+---------+
|        10248|        90|         5| 7/4/1996|      3.0|
|        10249|        81|         6| 7/5/1996|      1.0|
|        10250|        34|         4| 7/8/1996|      2.0|
|        10251|        84|         3| 7/8/1996|      1.0|
|        10252|        76|         4| 7/9/1996|      2.0|
|        10253|        34|         3|7/10/1996|      2.0|
|        10254|        14|         5|7/11/1996|      2.0|
|        10255|        68|         9|7/12/1996|      3.0|
|        10256|        88|         3|7/15/1996|      2.0|
|        10257|        35|         4|7/16/1996|      3.0|
|        10258|        20|         1|7/17/1996|      1.0|
|        10259|        13|         4|7/18/1996|      3.0|
|        10260|        55|         4|7/19/1996|      1.0|
|        10261|        61|         4|7/19/1996|      2.0|
|        10262|        65|         8|7/22/1996|      3.0|
|        10263|        20|         9|7/23/1996|      3.0|
|        10264|        24|         6|7/24/1996|      3.0|
|        10265|         7|         2|7/25/1996|      1.0|
|        10266|        87|         3|7/26/1996|      3.0|
|        10267|        25|         4|7/29/1996|      1.0|
+-------------+----------+----------+---------+---------+
only showing top 20 rows

In [23]:
# grouopBy() - 집계함수
orders.groupBy('EmployeeID').count().show()

+----------+-----+
|EmployeeID|count|
+----------+-----+
|         1|   29|
|         6|   18|
|         3|   31|
|         5|   11|
|         9|    6|
|         4|   40|
|         8|   27|
|         7|   14|
|         2|   20|
+----------+-----+

In [25]:
cospi =  sqlCtx.read.csv('C:/Users/i/TIL/Spark/exec_data/cospi.csv' , header=True , inferSchema=True)
type(cospi)

pyspark.sql.dataframe.DataFrame

In [28]:
cospi.printSchema()

root
 |-- Date: timestamp (nullable = true)
 |-- Open: integer (nullable = true)
 |-- High: integer (nullable = true)
 |-- Low: integer (nullable = true)
 |-- Close: integer (nullable = true)
 |-- Volume: integer (nullable = true)

In [30]:
# filter(조건식)
# 날짜가 2월인 데이터만 필터링
cospi.filter(cospi['Date'] >= '2016-02-01').show()

+-------------------+-------+-------+-------+-------+------+
|               Date|   Open|   High|    Low|  Close|Volume|
+-------------------+-------+-------+-------+-------+------+
|2016-02-26 00:00:00|1180000|1187000|1172000|1172000|176906|
|2016-02-25 00:00:00|1172000|1187000|1172000|1179000|128321|
|2016-02-24 00:00:00|1178000|1179000|1161000|1172000|140407|
|2016-02-23 00:00:00|1179000|1189000|1173000|1181000|147578|
|2016-02-22 00:00:00|1190000|1192000|1166000|1175000|174075|
|2016-02-19 00:00:00|1187000|1195000|1174000|1190000|175889|
|2016-02-18 00:00:00|1203000|1203000|1178000|1187000|211795|
|2016-02-17 00:00:00|1179000|1201000|1169000|1185000|245929|
|2016-02-16 00:00:00|1158000|1179000|1157000|1168000|179087|
|2016-02-15 00:00:00|1154000|1160000|1144000|1154000|182471|
|2016-02-12 00:00:00|1130000|1151000|1122000|1130000|254115|
|2016-02-11 00:00:00|1118000|1137000|1118000|1130000|304899|
|2016-02-05 00:00:00|1156000|1169000|1156000|1164000|183280|
|2016-02-04 00:00:00|1150000|1161000|1148000|1156000|236429|
|2016-02-03 00:00:00|1150000|1152000|1137000|1146000|174381|
|2016-02-02 00:00:00|1161000|1166000|1147000|1156000|165420|
|2016-02-01 00:00:00|1152000|1163000|1151000|1163000|258194|
+-------------------+-------+-------+-------+-------+------+

In [33]:
# 종가가 1154000 이상인 데이터만 필터링
cospi.filter(cospi['Close'] >= '1154000').select(['Date' , 'Open' , 'Close']).show()

+-------------------+-------+-------+
|               Date|   Open|  Close|
+-------------------+-------+-------+
|2016-02-26 00:00:00|1180000|1172000|
|2016-02-25 00:00:00|1172000|1179000|
|2016-02-24 00:00:00|1178000|1172000|
|2016-02-23 00:00:00|1179000|1181000|
|2016-02-22 00:00:00|1190000|1175000|
|2016-02-19 00:00:00|1187000|1190000|
|2016-02-18 00:00:00|1203000|1187000|
|2016-02-17 00:00:00|1179000|1185000|
|2016-02-16 00:00:00|1158000|1168000|
|2016-02-15 00:00:00|1154000|1154000|
|2016-02-05 00:00:00|1156000|1164000|
|2016-02-04 00:00:00|1150000|1156000|
|2016-02-02 00:00:00|1161000|1156000|
|2016-02-01 00:00:00|1152000|1163000|
|2016-01-27 00:00:00|1126000|1175000|
|2016-01-25 00:00:00|1172000|1162000|
|2016-01-22 00:00:00|1145000|1168000|
|2016-01-19 00:00:00|1128000|1171000|
|2016-01-08 00:00:00|1163000|1171000|
|2016-01-07 00:00:00|1166000|1163000|
+-------------------+-------+-------+
only showing top 20 rows

In [41]:
cospi.filter( (cospi['Open'] > 1200000) & (cospi['Open'] > 1250000) )

DataFrame[Date: timestamp, Open: int, High: int, Low: int, Close: int, Volume: int]

In [37]:
cospi.filter( (cospi['Open'] > 1200000) | (cospi['Open'] > 1250000) )

DataFrame[Date: timestamp, Open: int, High: int, Low: int, Close: int, Volume: int]

In [38]:
# Volume 30000 이하인 데이터 필터링
cospi.filter( ~(cospi['Volume'] > 300000 ) ).show()

+-------------------+-------+-------+-------+-------+------+
|               Date|   Open|   High|    Low|  Close|Volume|
+-------------------+-------+-------+-------+-------+------+
|2016-02-26 00:00:00|1180000|1187000|1172000|1172000|176906|
|2016-02-25 00:00:00|1172000|1187000|1172000|1179000|128321|
|2016-02-24 00:00:00|1178000|1179000|1161000|1172000|140407|
|2016-02-23 00:00:00|1179000|1189000|1173000|1181000|147578|
|2016-02-22 00:00:00|1190000|1192000|1166000|1175000|174075|
|2016-02-19 00:00:00|1187000|1195000|1174000|1190000|175889|
|2016-02-18 00:00:00|1203000|1203000|1178000|1187000|211795|
|2016-02-17 00:00:00|1179000|1201000|1169000|1185000|245929|
|2016-02-16 00:00:00|1158000|1179000|1157000|1168000|179087|
|2016-02-15 00:00:00|1154000|1160000|1144000|1154000|182471|
|2016-02-12 00:00:00|1130000|1151000|1122000|1130000|254115|
|2016-02-05 00:00:00|1156000|1169000|1156000|1164000|183280|
|2016-02-04 00:00:00|1150000|1161000|1148000|1156000|236429|
|2016-02-03 00:00:00|1150000|1152000|1137000|1146000|174381|
|2016-02-02 00:00:00|1161000|1166000|1147000|1156000|165420|
|2016-02-01 00:00:00|1152000|1163000|1151000|1163000|258194|
|2016-01-27 00:00:00|1126000|1175000|1126000|1175000|273707|
|2016-01-26 00:00:00|1155000|1157000|1136000|1137000|151638|
|2016-01-25 00:00:00|1172000|1176000|1156000|1162000|159769|
|2016-01-22 00:00:00|1145000|1168000|1145000|1168000|146591|
+-------------------+-------+-------+-------+-------+------+
only showing top 20 rows

In [39]:
# 날짜가 2.26 인 데이터 필터링
cospi.filter( ~(cospi['Date'] == '2016-02-26' ) ).show()

+-------------------+-------+-------+-------+-------+------+
|               Date|   Open|   High|    Low|  Close|Volume|
+-------------------+-------+-------+-------+-------+------+
|2016-02-25 00:00:00|1172000|1187000|1172000|1179000|128321|
|2016-02-24 00:00:00|1178000|1179000|1161000|1172000|140407|
|2016-02-23 00:00:00|1179000|1189000|1173000|1181000|147578|
|2016-02-22 00:00:00|1190000|1192000|1166000|1175000|174075|
|2016-02-19 00:00:00|1187000|1195000|1174000|1190000|175889|
|2016-02-18 00:00:00|1203000|1203000|1178000|1187000|211795|
|2016-02-17 00:00:00|1179000|1201000|1169000|1185000|245929|
|2016-02-16 00:00:00|1158000|1179000|1157000|1168000|179087|
|2016-02-15 00:00:00|1154000|1160000|1144000|1154000|182471|
|2016-02-12 00:00:00|1130000|1151000|1122000|1130000|254115|
|2016-02-11 00:00:00|1118000|1137000|1118000|1130000|304899|
|2016-02-05 00:00:00|1156000|1169000|1156000|1164000|183280|
|2016-02-04 00:00:00|1150000|1161000|1148000|1156000|236429|
|2016-02-03 00:00:00|1150000|1152000|1137000|1146000|174381|
|2016-02-02 00:00:00|1161000|1166000|1147000|1156000|165420|
|2016-02-01 00:00:00|1152000|1163000|1151000|1163000|258194|
|2016-01-29 00:00:00|1140000|1150000|1116000|1150000|426238|
|2016-01-28 00:00:00|1164000|1168000|1139000|1145000|314154|
|2016-01-27 00:00:00|1126000|1175000|1126000|1175000|273707|
|2016-01-26 00:00:00|1155000|1157000|1136000|1137000|151638|
+-------------------+-------+-------+-------+-------+------+
only showing top 20 rows

In [42]:
# data - titanic_train.csv
titanic =  sqlCtx.read.csv('C:/Users/i/TIL/Spark/exec_data/titanic_train.csv' , header=True , inferSchema=True)
type( titanic )

pyspark.sql.dataframe.DataFrame

In [43]:
titanic.show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|         14|       0|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| null|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| null|       S|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|          382652| 29.125| null|       Q|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|          244373|   13.0| null|       S|
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| null|       S|
|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|            2649|  7.225| null|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [44]:
titanic.columns

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

- count()

In [45]:
titanic.count()

891

In [47]:
# select 변수 선택 PassengerId , Name
titanic.select(['PassengerId' , 'Name']).show()

+-----------+--------------------+
|PassengerId|                Name|
+-----------+--------------------+
|          1|Braund, Mr. Owen ...|
|          2|Cumings, Mrs. Joh...|
|          3|Heikkinen, Miss. ...|
|          4|Futrelle, Mrs. Ja...|
|          5|Allen, Mr. Willia...|
|          6|    Moran, Mr. James|
|          7|McCarthy, Mr. Tim...|
|          8|Palsson, Master. ...|
|          9|Johnson, Mrs. Osc...|
|         10|Nasser, Mrs. Nich...|
|         11|Sandstrom, Miss. ...|
|         12|Bonnell, Miss. El...|
|         13|Saundercock, Mr. ...|
|         14|Andersson, Mr. An...|
|         15|Vestrom, Miss. Hu...|
|         16|Hewlett, Mrs. (Ma...|
|         17|Rice, Master. Eugene|
|         18|Williams, Mr. Cha...|
|         19|Vander Planke, Mr...|
|         20|Masselmani, Mrs. ...|
+-----------+--------------------+
only showing top 20 rows

In [48]:
# 성별이 여성이면서 살아 있는 'PassengerId' , 'Name', 'Sex', 'Survived'  출력
titanic.filter( (titanic.Sex == 'female') & (titanic.Survived == 1) ).select(['PassengerId' , 'Name', 'Sex', 'Survived' ]).show()

+-----------+--------------------+------+--------+
|PassengerId|                Name|   Sex|Survived|
+-----------+--------------------+------+--------+
|          2|Cumings, Mrs. Joh...|female|       1|
|          3|Heikkinen, Miss. ...|female|       1|
|          4|Futrelle, Mrs. Ja...|female|       1|
|          9|Johnson, Mrs. Osc...|female|       1|
|         10|Nasser, Mrs. Nich...|female|       1|
|         11|Sandstrom, Miss. ...|female|       1|
|         12|Bonnell, Miss. El...|female|       1|
|         16|Hewlett, Mrs. (Ma...|female|       1|
|         20|Masselmani, Mrs. ...|female|       1|
|         23|"McGowan, Miss. A...|female|       1|
|         26|Asplund, Mrs. Car...|female|       1|
|         29|"O'Dwyer, Miss. E...|female|       1|
|         32|Spencer, Mrs. Wil...|female|       1|
|         33|Glynn, Miss. Mary...|female|       1|
|         40|Nicola-Yarred, Mi...|female|       1|
|         44|Laroche, Miss. Si...|female|       1|
|         45|Devaney, Miss. Ma...|female|       1|
|         48|O'Driscoll, Miss....|female|       1|
|         53|Harper, Mrs. Henr...|female|       1|
|         54|Faunthorpe, Mrs. ...|female|       1|
+-----------+--------------------+------+--------+
only showing top 20 rows

In [49]:
# 선실등급 별 요금 평균 확인
# class_grp = titanic.groupBy('Pclass')
# class_grp.count().show()
# class.grp.avg('Fare').show()
# type( class_grp )

# 정렬 sort()
titanic.groupBy('Pclass').avg('Fare').sort('avg(Fare)' , ascending=False).show()

+------+------------------+
|Pclass|         avg(Fare)|
+------+------------------+
|     1| 84.15468749999992|
|     2| 20.66218315217391|
|     3|13.675550101832997|
+------+------------------+

### Spark DB 연동

In [50]:
from pyspark import SparkConf , SparkContext
from pyspark.sql import SQLContext

In [51]:
import pandas as pd

In [52]:
data1 = {'PassengerId':{0:1, 1:2, 2:3, 3:4, 4:5},
         'Name' : {0:'Owen', 1:'Florence', 2:'Laina', 3:'Lily', 4:"William"},
         'sex' : {0: 'male', 1: 'female', 2:'female', 3:'female', 4:'male'},
         'Survived': {0:0, 1:1, 2:1, 3:1, 4:0}
        }

data2 = {'PassengerId':{0:1, 1:2, 2:3, 3:4, 4:5},
         'Age' : {0: 22, 1: 38, 2: 33, 3: 35, 4: 35},
         'Fare' : {0: 7.3, 1: 71.3, 2:7.9, 3:53.1, 4:8.0},
         'Pclass': {0:3, 1:1, 2:3, 3:1, 4:3}
        }

In [53]:
# data1.keys()
# data2.keys()

- pandas df -> spark df

In [54]:
sample_df01 = pd.DataFrame(data1 , columns=data1.keys())
sampl_df02 = pd.DataFrame(data2 , columns=data2.keys())
display(sample_df01)
display(sample_df01)
type(sample_df01)

   PassengerId      Name     sex  Survived
0            1      Owen    male         0
1            2  Florence  female         1
2            3     Laina  female         1
3            4      Lily  female         1
4            5   William    male         0

   PassengerId      Name     sex  Survived
0            1      Owen    male         0
1            2  Florence  female         1
2            3     Laina  female         1
3            4      Lily  female         1
4            5   William    male         0

pandas.core.frame.DataFrame

In [59]:
# pandas -> spark type 의 DF 로 만드는 방법
spark_df01 = sqlCtx.createDataFrame(sample_df01)
type(spark_df01)

spark_df02 = sqlCtx.createDataFrame(sample_df02)
type(spark_df02)

NameError: name 'sample_df02' is not defined

In [57]:
spark_df01.printSchema()

root
 |-- PassengerId: long (nullable = true)
 |-- Name: string (nullable = true)
 |-- sex: string (nullable = true)
 |-- Survived: long (nullable = true)

In [58]:
spark_df02.printSchema()

NameError: name 'spark_df02' is not defined

In [ ]:
spark_df01.show()

In [ ]:
spark_df02.show()

In [ ]:
# mirroring
spark_df01.createOrReplaceTempVeiw('titanic01')
spark_df02.createOrReplaceTempVeiw('titanic02')

In [ ]:
spark.sql('select * from titanic01').show()

In [ ]:
sqlCtx.sql("select * from titanic01 where sex='male' ").show()

In [ ]:
# 성별에 따른 생존자 수 구하기
sqlCtx.sql("""    SELECT SEX , COUNT(SURVIVED) AS CNT
                        FROM TITANIC01
                        GROUP BY SEX""").show()

In [12]:
taxi_train_file_loc = "wasb://mllibwalkthroughs@cdspsparksamples.blob.core.windows.net/Data/NYCTaxi/JoinedTaxiTripFare.Point1Pct.Train.tsv"